src/InformationRegisters/НастройкиОтраженияКорреспонденцийВМеждународномУчете/НастройкиОтраженияКорреспонденцийВМеждународномУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтраженияКорреспонденцийВМеждународномУчете</name>
  <resources>
    <name>НеОтражаетсяНаСчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаОпределяетсяНастройкойОбъектаДт</name>
    <comment>Признак учета дебетовой части корреспонденции по настройке объекта учета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаОпределяетсяНастройкойОбъектаКт</name>
    <comment>Признак учета кредитовой части корреспонденции по настройке объекта учета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательскаяНастройкаЗаполненияСубконтоДт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоДт1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполненияСубконтоДт1</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСубконтоМеждународногоУчета</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияСубконтоДт1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказанноеЗначениеСубконтоДт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоДт2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполненияСубконтоДт2</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСубконтоМеждународногоУчета</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияСубконтоДт2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказанноеЗначениеСубконтоДт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоДт3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполненияСубконтоДт3</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСубконтоМеждународногоУчета</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияСубконтоДт3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказанноеЗначениеСубконтоДт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательскаяНастройкаЗаполненияСубконтоКт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоКт1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполненияСубконтоКт1</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСубконтоМеждународногоУчета</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияСубконтоКт1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказанноеЗначениеСубконтоКт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоКт2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполненияСубконтоКт2</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСубконтоМеждународногоУчета</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияСубконтоКт2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказанноеЗначениеСубконтоКт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоКт3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполненияСубконтоКт3</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСубконтоМеждународногоУчета</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияСубконтоКт3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказанноеЗначениеСубконтоКт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>РучноеУточнениеПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнвертироватьЗнакРесурсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДополнительныйОтборДт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтборДт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДополнительныйОтборКт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтборКт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименятьПоследующиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаФормированияПроводок</name>
    <type>
      <types>CatalogRef.НастройкиФормированияПроводокМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчетаДт</name>
    <type>
      <types>EnumRef.ОбъектыФинансовогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчетаКт</name>
    <type>
      <types>EnumRef.ОбъектыФинансовогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолгосрочныйДт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолгосрочныйКт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядокПрименения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиОтраженияКорреспонденцийВМеждународномУчете/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыПолученияДанныхНастройки() Экспорт
	
	ПараметрыПолучения = Новый Структура();
	
	РегистрМетаданные = СоздатьНаборЗаписей().Метаданные();
	
	Для Каждого Измерение Из РегистрМетаданные.Измерения Цикл
		Если НЕ Измерение.Имя = "ПорядокПрименения" Тогда
			ПараметрыПолучения.Вставить(Измерение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыПолучения;
	
КонецФункции

Функция КоличествоНастроекКорренспонденции(ПараметрыПолученияДанных) Экспорт
	
	КоличествоНастроек = 0;
	
	Если Не ЗначениеЗаполнено(ПараметрыПолученияДанных.ПланСчетов) 
		Или Не ЗначениеЗаполнено(ПараметрыПолученияДанных.НастройкаФормированияПроводок)
		Или Не ЗначениеЗаполнено(ПараметрыПолученияДанных.ОбъектУчетаДт) 
		Или Не ЗначениеЗаполнено(ПараметрыПолученияДанных.ОбъектУчетаКт) Тогда
		Возврат КоличествоНастроек;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	РегистрСведений.НастройкиОтраженияКорреспонденцийВМеждународномУчете КАК НастройкиОтражения
	|ГДЕ
	|	НастройкиОтражения.ПланСчетов = &ПланСчетов
	|	И НастройкиОтражения.НастройкаФормированияПроводок = &НастройкаФормированияПроводок
	|	И НастройкиОтражения.ОбъектУчетаДт = &ОбъектУчетаДт
	|	И НастройкиОтражения.ОбъектУчетаКт = &ОбъектУчетаКт
	|	И НастройкиОтражения.ДолгосрочныйДт = &ДолгосрочныйДт
	|	И НастройкиОтражения.ДолгосрочныйКт = &ДолгосрочныйКт
	|";
	Запрос.УстановитьПараметр("ПланСчетов", ПараметрыПолученияДанных.ПланСчетов);
	Запрос.УстановитьПараметр("НастройкаФормированияПроводок", ПараметрыПолученияДанных.НастройкаФормированияПроводок);
	Запрос.УстановитьПараметр("ОбъектУчетаДт", ПараметрыПолученияДанных.ОбъектУчетаДт);
	Запрос.УстановитьПараметр("ОбъектУчетаКт", ПараметрыПолученияДанных.ОбъектУчетаКт);
	Запрос.УстановитьПараметр("ДолгосрочныйДт", ПараметрыПолученияДанных.ДолгосрочныйДт);
	Запрос.УстановитьПараметр("ДолгосрочныйКт", ПараметрыПолученияДанных.ДолгосрочныйКт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоНастроек = Выборка.Количество;
	КонецЕсли;
	
	Возврат КоличествоНастроек;
	
КонецФункции

Функция ПорядокПримененияНастройки(ПараметрыПолученияДанных) Экспорт
	
	ПорядокПрименения = 0;
	
	Если Не ЗначениеЗаполнено(ПараметрыПолученияДанных.ПланСчетов) 
		Или Не ЗначениеЗаполнено(ПараметрыПолученияДанных.НастройкаФормированияПроводок)
		Или Не ЗначениеЗаполнено(ПараметрыПолученияДанных.ОбъектУчетаДт) 
		Или Не ЗначениеЗаполнено(ПараметрыПолученияДанных.ОбъектУчетаКт) Тогда
		Возврат ПорядокПрименения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОтражения.ПорядокПрименения КАК ПорядокПрименения
	|ИЗ
	|	РегистрСведений.НастройкиОтраженияКорреспонденцийВМеждународномУчете КАК НастройкиОтражения
	|ГДЕ
	|	НастройкиОтражения.ПланСчетов = &ПланСчетов
	|	И НастройкиОтражения.НастройкаФормированияПроводок = &НастройкаФормированияПроводок
	|	И НастройкиОтражения.ОбъектУчетаДт = &ОбъектУчетаДт
	|	И НастройкиОтражения.ОбъектУчетаКт = &ОбъектУчетаКт
	|	И НастройкиОтражения.ДолгосрочныйДт = &ДолгосрочныйДт
	|	И НастройкиОтражения.ДолгосрочныйКт = &ДолгосрочныйКт
	|	
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиОтражения.ПорядокПрименения УБЫВ";
	Запрос.УстановитьПараметр("ПланСчетов", ПараметрыПолученияДанных.ПланСчетов);
	Запрос.УстановитьПараметр("НастройкаФормированияПроводок", ПараметрыПолученияДанных.НастройкаФормированияПроводок);
	Запрос.УстановитьПараметр("ОбъектУчетаДт", ПараметрыПолученияДанных.ОбъектУчетаДт);
	Запрос.УстановитьПараметр("ОбъектУчетаКт", ПараметрыПолученияДанных.ОбъектУчетаКт);
	Запрос.УстановитьПараметр("ДолгосрочныйДт", ПараметрыПолученияДанных.ДолгосрочныйДт);
	Запрос.УстановитьПараметр("ДолгосрочныйКт", ПараметрыПолученияДанных.ДолгосрочныйКт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПорядокПрименения = Выборка.ПорядокПрименения;
	КонецЕсли;
	
	ПорядокПрименения = ПорядокПрименения + 1;
	
	Возврат ПорядокПрименения;
	
КонецФункции

// Изменяет порядок применения настройки на некоторое число позиций
// 
// Параметры:
// 	КлючЗаписи - РегистрСведенийКлючЗаписи.НастройкиОтраженияКорреспонденцийВМеждународномУчете - Исходный ключ записи настройки
// 	Сдвиг - Число - Число позиций, на которые необходимо изменить порядок применения настройки
//
// Возвращаемое значение:
// 	РегистрСведенийКлючЗаписи.НастройкиОтраженияКорреспонденцийВМеждународномУчете - Ключ записи настроки после изменения порядка применения.
Функция ИзменитьПорядокПримененияНастройки(КлючЗаписи, Сдвиг) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных();
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиОтраженияКорреспонденцийВМеждународномУчете");
		ЭлементБлокировкиДанных.УстановитьЗначение("ПланСчетов", КлючЗаписи.ПланСчетов);
		ЭлементБлокировкиДанных.УстановитьЗначение("НастройкаФормированияПроводок", КлючЗаписи.НастройкаФормированияПроводок);
		ЭлементБлокировкиДанных.УстановитьЗначение("ОбъектУчетаДт", КлючЗаписи.ОбъектУчетаДт);
		ЭлементБлокировкиДанных.УстановитьЗначение("ОбъектУчетаКт", КлючЗаписи.ОбъектУчетаКт);
		ЭлементБлокировкиДанных.УстановитьЗначение("ДолгосрочныйДт", КлючЗаписи.ДолгосрочныйДт);
		ЭлементБлокировкиДанных.УстановитьЗначение("ДолгосрочныйКт", КлючЗаписи.ДолгосрочныйКт);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ТекущийПорядокПрименения = КлючЗаписи.ПорядокПрименения;
		
		НаборЗаписей = РегистрыСведений.НастройкиОтраженияКорреспонденцийВМеждународномУчете.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПланСчетов.Установить(КлючЗаписи.ПланСчетов);
		НаборЗаписей.Отбор.НастройкаФормированияПроводок.Установить(КлючЗаписи.НастройкаФормированияПроводок);
		НаборЗаписей.Отбор.ОбъектУчетаДт.Установить(КлючЗаписи.ОбъектУчетаДт);
		НаборЗаписей.Отбор.ОбъектУчетаКт.Установить(КлючЗаписи.ОбъектУчетаКт);
		НаборЗаписей.Отбор.ДолгосрочныйДт.Установить(КлючЗаписи.ДолгосрочныйДт);
		НаборЗаписей.Отбор.ДолгосрочныйКт.Установить(КлючЗаписи.ДолгосрочныйКт);
		
		НаборЗаписей.Прочитать();
		
		НовыйПорядокПрименения = ТекущийПорядокПрименения + Сдвиг;
		
		Если НовыйПорядокПрименения < 1 Или НовыйПорядокПрименения > НаборЗаписей.Количество() Тогда
			ОтменитьТранзакцию();
			Возврат КлючЗаписи;
		КонецЕсли;
		
		ТаблицаЗаписей = НаборЗаписей.Выгрузить();
		
		Запись = ТаблицаЗаписей[ТекущийПорядокПрименения - 1];
		ТаблицаЗаписей.Сдвинуть(Запись, Сдвиг);
		
		ПорядокПрименения = 1;
		Для каждого СтрокаТаблицы Из ТаблицаЗаписей Цикл
			СтрокаТаблицы.ПорядокПрименения = ПорядокПрименения;
			ПорядокПрименения = ПорядокПрименения + 1;
		КонецЦикла;
	
		ЗначенияКлюча = Новый Структура;
		Для каждого Измерение Из Метаданные.РегистрыСведений.НастройкиОтраженияКорреспонденцийВМеждународномУчете.Измерения Цикл
			ЗначенияКлюча.Вставить(Измерение.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(ЗначенияКлюча, Запись);
		НовыйКлючЗаписи = СоздатьКлючЗаписи(ЗначенияКлюча);
		
		НаборЗаписей.Загрузить(ТаблицаЗаписей);
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось изменить порядок применения записи по причине: %1';
										|en = 'Cannot change the record application procedure due to: %1'"),  ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат НовыйКлючЗаписи;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
